Revit 2027 API
TessellatedShapeBuilderResult.HasInvalidData Property
 Whether there were any inconsistencies in the face sets, stored in the tessellated shape builder while building geometrical objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasInvalidData { get; }
Public ReadOnly Property HasInvalidData As Boolean
	Get
public:
property bool HasInvalidData {
	bool get ();
}
member HasInvalidData : bool with get
Property Value
Boolean
See Also
Reference
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace